Public Attributes | List of all members
API_IFCClassificationReference Struct Reference
Element Manager API
IFC classificationreference structure. More...
#include <APIdefs_Properties.h>
 Public Attributes
GS::UniString  | referenceName
name of the IfcRelAssociatesClassification
bool  | readOnly
whether the classificationreference is read-only on user interface
GS::Optional< GS::UniString >  | location
location of the classificationreference
GS::Optional< GS::UniString >  | name
name of the classificationreference
GS::Optional< GS::UniString >  | identification
identification of the classificationreference
API_IFCClassification  | referencedSource
referencedsource of the classificationreference
Detailed Description
IFC classificationreference structure.
Remarks
This structure contains the data of an IfcClassificationReference. referenceName is unique for classificationreferences of an element.
Member Data Documentation
◆ identification
 API_IFCClassificationReference::identification
identification of the classificationreference
◆ location
 API_IFCClassificationReference::location
location of the classificationreference
◆ name
 API_IFCClassificationReference::name
name of the classificationreference
◆ readOnly
 API_IFCClassificationReference::readOnly
whether the classificationreference is read-only on user interface
◆ referencedSource
 API_IFCClassificationReference::referencedSource
referencedsource of the classificationreference
◆ referenceName
 API_IFCClassificationReference::referenceName
name of the IfcRelAssociatesClassification